uhnp/src/Reports/УправлениеЛимитами/УправлениеЛимитами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>УправлениеЛимитами</name>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УОП</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Периоды</name>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦФОПроекты</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КУстановкеУОП</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>УОП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КОткрытиюЗакрытиюПериодов</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦФОПроектыПериодыЛимитированияВалюты</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

uhnp/src/Documents/УправлениеПериодомСценария/УправлениеПериодомСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УправлениеПериодомСценария</name>
  <posting>Deny</posting>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяПериодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценарияОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОрганизационнойСтруктуры</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроцесса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСкользящегоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаАктуализации</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийГоризонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗапускатьПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭкземплярПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачалаСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончанияСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПервоеПрименение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыОтчетовДляУстановкиЛимитов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПериодическиеКурсы</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериодМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаНачалоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПредыдущийПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПредыдущегоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/РакурсДанных/РакурсДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РакурсДанных</name>
  <registerRecords>AccumulationRegister.УдалитьЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачалоДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончаниеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеЗаблокировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Reports/УправлениеЛимитами/Forms/ФормаУстановкиУОПДляВыбранныхПозиций/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ВидБюджета, Предназначение, ПериодичностьЛимитирования, НачалоПериода, ОкончаниеПериода");
	
	Объект.ВидБюджета = ВидБюджета;
	
	Для Каждого Строка Из Параметры.Данные Цикл
		ЗаполнитьЗначенияСвойств(Объект.КУстановкеУОП.Добавить(), Строка, "ЦФО, Проект, ПериодЛимитирования, Сценарий, УОП");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ШаблонСообщения = НСтр("ru = 'В строке %1 не не заполнено поле ""%2""'");
	ШаблонПутиПоля = "Объект.КУстановкеУОП[%1]";
	Для Каждого Строка Из Объект.КУстановкеУОП Цикл
		
		ПутьКПолю = СтрШаблон(ШаблонПутиПоля, Строка.НомерСтроки-1);
		Если НЕ ЗначениеЗаполнено(Строка.ЦФО) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.НомерСтроки, НСтр("ru = 'ЦФО'")), , ПутьКПолю + ".ЦФО", , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ПериодЛимитирования) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.НомерСтроки, НСтр("ru = 'Период лимитирования'")), , ПутьКПолю + ".ПериодЛимитирования", , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.УОП) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.НомерСтроки, НСтр("ru = 'Сценарий'")), , ПутьКПолю + ".УОП", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка наличия дублей
	ИменаРеквизитов = "ЦФО, Проект, ПериодЛимитирования";
	Данные = Объект.КУстановкеУОП.Выгрузить();
	ЦФОПроектПериод = Данные.Скопировать(, ИменаРеквизитов);
	ЦФОПроектПериод.Свернуть(ИменаРеквизитов, "");
	
	ШаблонСообщения = НСтр("ru = 'Значения строки %1 совпадают со значениями  одной или нескольких других строк. Устраните дублирование данных и повторите операцию.'");
	
	СтруктураПоиска = Новый Структура(ИменаРеквизитов);
	Для Каждого Строка Из ЦФОПроектПериод Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);
		
		СтрокиДанных = Данные.НайтиСтроки(СтруктураПоиска);
		Если СтрокиДанных.Количество() >1 Тогда
			Для Каждого СтрокаДанных Из СтрокиДанных Цикл
				ПутьКПолю = СтрШаблон(ШаблонПутиПоля, СтрокаДанных.НомерСтроки-1);
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, СтрокаДанных.НомерСтроки), , ПутьКПолю+".Сценарий", , Отказ);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектКУстановкеУОП

&НаКлиенте
Процедура ОбъектКУстановкеУОПСценарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//
	ДопПараметры = Новый Структура("ВидБюджета, Предназначение, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ДопПараметры, ЭтотОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьУОПДляСтрокиЗавершение", ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("Отчет.УправлениеЛимитами.Форма.ФормаВыбораСценарияДляУстановкиЛимита", ДопПараметры, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКУстановкеУОПСценарийОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ОбъектКУстановкеУОП.ТекущиеДанные.УОП = ПредопределенноеЗначение("Документ.УправлениеПериодомСценария.ПустаяСсылка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьУОП(Команда)
	
	ДопПараметры = Новый Структура("ВидБюджета, Предназначение, НачалоПериода, ОкончаниеПериода");
	ЗаполнитьЗначенияСвойств(ДопПараметры, ЭтотОбъект);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьУОПЗавершение", ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("Отчет.УправлениеЛимитами.Форма.ФормаВыбораСценарияДляУстановкиЛимита", ДопПараметры, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУстановкуЛимитов(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ПолучитьРезультат());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьРезультат()
	
	Возврат Объект.КУстановкеУОП;
	
КонецФункции

#Область ОбработкаВыбораУОПСценарий
	
&НаКлиенте
Процедура ВыбратьУОПЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьУОПДляВыбранныхПозиций(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьУОПДляСтрокиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУОПДляТекущейСтрокиНаСервере(Результат);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУОПДляВыбранныхПозиций(Результат)
	
	ДанныеУОП = ПолучитьДанныеУОП(Результат.УОП);
	Для Каждого Строка Из Объект.КУстановкеУОП Цикл
		ЗаполнитьУОПСценарийДляСтроки(Строка, Результат, ДанныеУОП);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУОПДляТекущейСтрокиНаСервере(Результат)
	ДанныеУОП = ПолучитьДанныеУОП(Результат.УОП);
	ТекущаяСтрока = Объект.КУстановкеУОП.НайтиПоИдентификатору(Элементы.ОбъектКУстановкеУОП.ТекущаяСтрока);
	ЗаполнитьУОПСценарийДляСтроки(ТекущаяСтрока, Результат, ДанныеУОП);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУОПСценарийДляСтроки(Строка, Результат, ДанныеУОП)
	
	Если ЦФОПроектПериодЕстьВУОП(Строка.ЦФО, Строка.Проект, Строка.ПериодЛимитирования, ДанныеУОП) Тогда
		Строка.УОП = Результат.УОП;
		Строка.Сценарий = Результат.Сценарий;
	Иначе
		Строка.УОП = Документы.УправлениеПериодомСценария.ПустаяСсылка();
		Строка.Сценарий = Справочники.Сценарии.ПустаяСсылка();
		ШаблонСообщения = НСтр("ru = 'В строке %1 сценарий не установлен, так как в нем отсутствуют данные по ЦФО, Проекту и Периоду лимитирования'");
		ШаблонПутиПоля = "Объект.КУстановкеУОП[%1]";
		ПутьКПолю = СтрШаблон(ШаблонПутиПоля, Строка.НомерСтроки-1);
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.НомерСтроки), , ПутьКПолю + ".Сценарий");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеУОП(УОП)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предназначение", Предназначение);
	Запрос.УстановитьПараметр("НачалоУстановки", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеУстановки", ОкончаниеПериода);
	Запрос.УстановитьПараметр("УОП", УОП);
	Запрос.УстановитьПараметр("Периодичность", ПериодичностьЛимитирования);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Периоды.Ссылка КАК ПериодЛимитирования
	|ПОМЕСТИТЬ ВТ_ПериодыЛимитирования
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.Периодичность = &Периодичность
	|	И Периоды.ДатаНачала >= &ДатаНачала
	|	И Периоды.ДатаОкончания <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыОтчетовПараметрыУстановкиЛимитов.Ссылка КАК ВидОтчета
	|ПОМЕСТИТЬ ВТ_ВидыОтчетовСЛимитированием
	|ИЗ
	|	Справочник.ВидыОтчетов.ПараметрыУстановкиЛимитов КАК ВидыОтчетовПараметрыУстановкиЛимитов
	|ГДЕ
	|	ВидыОтчетовПараметрыУстановкиЛимитов.Ссылка.МожетИспользоватьсяДляУстановкиЛимитов = ИСТИНА
	|	И ВидыОтчетовПараметрыУстановкиЛимитов.ВидБюджета = &Предназначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Запрос.ЦФО КАК ЦФО,
	|	Запрос.Проект КАК Проект,
	|	Запрос.ПериодЛимитирования КАК ПериодЛимитирования
	|ИЗ
	|	(ВЫБРАТЬ
	|		НастраиваемыйОтчет.Организация КАК ЦФО,
	|		НастраиваемыйОтчет.Проект КАК Проект,
	|		ВТ_ПериодыЛимитирования.ПериодЛимитирования КАК ПериодЛимитирования
	|	ИЗ
	|		Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет,
	|		ВТ_ПериодыЛимитирования КАК ВТ_ПериодыЛимитирования
	|	ГДЕ
	|		НастраиваемыйОтчет.УправлениеПериодом = &УОП
	|		И НастраиваемыйОтчет.УправлениеПериодом.УстанавливатьЛимиты = ИСТИНА
	|		И НастраиваемыйОтчет.ВидОтчета В
	|				(ВЫБРАТЬ
	|					Данные.ВидОтчета КАК ВидОтчета
	|				ИЗ
	|					ВТ_ВидыОтчетовСЛимитированием КАК Данные)
	|		И НастраиваемыйОтчет.УправлениеПериодом.ПометкаУдаления = ЛОЖЬ
	|		И НастраиваемыйОтчет.УправлениеПериодом.ПериодСценария.ДатаНачала <= &НачалоУстановки
	|		И НастраиваемыйОтчет.УправлениеПериодом.ПериодСценарияОкончание.ДатаОкончания >= &ОкончаниеУстановки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РакурсДанных.Организация,
	|		РакурсДанных.Проект,
	|		ВТ_ПериодыЛимитирования.ПериодЛимитирования
	|	ИЗ
	|		Документ.РакурсДанных КАК РакурсДанных
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
	|			ПО РакурсДанных.Сценарий = УправлениеПериодомСценария.Сценарий
	|				И РакурсДанных.ПериодОтчета = УправлениеПериодомСценария.ПериодСценария,
	|		ВТ_ПериодыЛимитирования КАК ВТ_ПериодыЛимитирования
	|	ГДЕ
	|		УправлениеПериодомСценария.Ссылка = &УОП
	|		И УправлениеПериодомСценария.Ссылка.УстанавливатьЛимиты = ИСТИНА
	|		И РакурсДанных.Область.Владелец В
	|				(ВЫБРАТЬ
	|					Данные.ВидОтчета КАК ВидОтчета
	|				ИЗ
	|					ВТ_ВидыОтчетовСЛимитированием КАК Данные)
	|		И УправлениеПериодомСценария.Ссылка.ПометкаУдаления = ЛОЖЬ
	|		И УправлениеПериодомСценария.Ссылка.ПериодСценария.ДатаНачала <= &НачалоУстановки
	|		И УправлениеПериодомСценария.Ссылка.ПериодСценарияОкончание.ДатаОкончания >= &ОкончаниеУстановки) КАК Запрос";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат Результат.Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ЦФОПроектПериодЕстьВУОП(ЦФО, Проект, ПериодЛимитирования, ДанныеУОП)
	
	СтруктураПоиска = Новый Структура("ЦФО, Проект, ПериодЛимитирования", ЦФО, Проект, ПериодЛимитирования);
	Возврат ДанныеУОП.НайтиСтроки(СтруктураПоиска).Количество() > 0;
	
КонецФункции

#КонецОбласти 

#КонецОбласти
